senserf/picos/PicOS/CC13XX/TENTATIVE/rfprop_nowor_ok.c
/*
	Copyright 2002-2023 (C) Olsonet Communications Corporation
	Programmed by Pawel Gburzynski & Wlodek Olesinski
	All rights reserved

	This file is part of the PICOS platform

*/

// ============================================================================
// CC1350 RF driver operating in the so-called proprietary mode ===============
// ============================================================================

// Needed by some library includes
#define	DEVICE_FAMILY	cc13x0

#include <driverlib/rf_common_cmd.h>
#include <driverlib/rf_prop_cmd.h>
#include <driverlib/rf_prop_mailbox.h>
#include <driverlib/rf_data_entry.h>
#include <driverlib/rfc.h>
#include <inc/hw_rfc_rat.h>

// ============================================================================
// Notes and issues:
// ============================================================================
//
// Check if using RF memory allows us to lower the power budget. This is tricky
// because we have to circumvent the patch area.
//
// How can we prevent interrupting reception in progress by a transmission?
// We can have reception with a timeout while waiting for sync, which should do
// for synchronized acks (and stuff like that). I don't think we can detect
// reception and postpone transmission any other way.
//
// Cold-starting up the transmitter takes 5ms; check the reference code again
// Can we do better?
//
// ============================================================================

#if 0
#define	TIME_COLDSTART		do { \
		GPIO_setOutputEnableDio (IOID_29, GPIO_OUTPUT_ENABLE); \
		GPIO_clearDio (IOID_29); \
	} while (0)
#define	TIME_COLDSTART_ON	GPIO_setDio (IOID_29)
#define	TIME_COLDSTART_OFF	GPIO_clearDio (IOID_29)
#else
#define	TIME_COLDSTART		CNOP
#define	TIME_COLDSTART_ON	CNOP
#define	TIME_COLDSTART_OFF	CNOP
#endif

// ============================================================================

// The RAT clock rate is 4MHz
#define	RAT_TICKS_PER_US		4

// TX command header size (shared by TX and ADV)
#define	TX_ADV_HEADER_SIZE		14

#include <rf_patches/rf_patch_cpe_genfsk.h>
#include <rf_patches/rf_patch_rfe_genfsk.h>

#include "sysio.h"
#include "tcvphys.h"
#include "cc1350.h"

// Radio parameter settings by TI
#define	mkmk_eval
#include "smartrf_settings.h"
#undef	mkmk_eval

#define	DETECT_HANGUPS	100

// ============================================================================

static	int paylen = 0;			// Current TX payload length

static byte	rbuffl = 0,		// Input buffer length
		dstate = 0;		// Driver state

#if RADIO_LBT_SENSE_TIME > 0
static byte	txtries = 0;		// Number of TX attempts for current pkt
#endif

#if RADIO_LBT_MAX_TRIES > 255
#undef	RADIO_LBT_MAX_TRIES
#define	RADIO_LBT_MAX_TRIES	255
#endif

// State flags
#define	DSTATE_RXON	0x01	// Rx formally turned on
#define	DSTATE_RXAC	0x02	// Rx physically active
#define	DSTATE_TXIP	0x04	// Tx in progress
#define	DSTATE_RFON	0x10	// Device physically on
#define	DSTATE_IRST	0x80	// Reset request

// The number of simultaneous receive buffers
#define	NRBUFFS		2

// The secret (undocumented) command (stolen from tirtos)
#define	RF_CMD0		0x0607

static byte	vrate = RADIO_BITRATE_INDEX,
		channel = RADIO_DEFAULT_CHANNEL;

#if RADIO_DEFAULT_POWER <= 7
// ============================================================================
// Power can be changed; the max power must be hardwired (with rate 0) for
// long range operation
// ============================================================================

static byte txpower;

// Used to be const, but we want to be able to modify the values from the
// default settings and also be able to revert to the defaults
static word patable_def [] = CC1350_PATABLE;	// Default power settings
static address patable = patable_def;		// Effective settings

#endif

static word	physid,
		statid = 0,
		bckf_timer = 0;

static cc1350_rfparams_t params = {
//
// These are the parameters settable with PHYSOPT_SETPARAMS, see cc1350.h
//
	// Delay before the device goes off if the RX is off and the output
	// queue dries out. Expressed in PicOS msecs.
	.offdelay	= RADIO_DEFAULT_OFFDELAY,
};

typedef struct {
		word	ps,	// prescale
			rw;	// rate word
		// The actual exact rate computed from the raw parameters, so
		// we don't have to compute it
		lword	rt;
} ratable_t;

static const ratable_t ratable [] = CC1350_RATABLE;

#define	NRATES	(sizeof (ratable)/sizeof (ratable_t))

// Pointer to the queue of reception buffers
#define	rbuffs 		(RF_cmdPropRx . pQueue)

// Reception statistics (can be extracted via PHYSOPT_ERROR)
static rfc_propRxOutput_t	rxstat;

// Events
static aword drvprcs, qevent, to_trigger;
// This can be any address
#define	txevent ((aword)&to_trigger)

// ============================================================================

#if 0
// A command to retrieve firmware version and stuff
static rfc_CMD_GET_FW_INFO_t	cmd_gfi = { .commandNo = CMD_GET_FW_INFO };
#endif

#if 0
// Ping command
static rfc_CMD_PING_t		cmd_pin = { .commandNo = CMD_PING };
#endif

// Command to start the RAT (timer)
static rfc_CMD_SYNC_START_RAT_t	cmd_srt = { .commandNo = CMD_SYNC_START_RAT };

#if RADIO_LBT_SENSE_TIME > 0

#if RADIO_LBT_CORR_PERIOD == 0
#define	ENABLE_CORR_LBT	0
#else
#define	ENABLE_CORR_LBT	1
#endif

// Command for carrier sense (LBT)
static volatile rfc_CMD_PROP_CS_t cmd_cs = {
		.commandNo = CMD_PROP_CS,
		// Chained to TX
		.pNextOp = (rfc_radioOp_t*) &RF_cmdPropTx,
		.startTime = 0,
		.startTrigger.triggerType = 0,	// Immediately
		.startTrigger.bEnaCmd = 0,
		.startTrigger.triggerNo = 0,
		.startTrigger.pastTrig = 0,
		// True means channel busy
		.condition.rule = COND_STOP_ON_TRUE,
		.condition.nSkip = 0,
		// Keep everything running, no matter what
		.csFsConf.bFsOffIdle = 0,
		.csFsConf.bFsOffBusy = 0,
		// What we measure
		.csConf.bEnaRssi = 1,
		.csConf.bEnaCorr = ENABLE_CORR_LBT,
		.csConf.operation = 0,	// EITHER (as opposed to AND)
		.csConf.busyOp = 1,	// End sensing when channel found busy
		.csConf.idleOp = 0,	// Continue when idle
		.csConf.timeoutRes = 0,	// Timeout on invalid = busy (not idle)
		// Converted from absolute to signed
		.rssiThr = (byte)(RADIO_LBT_RSSI_THRESHOLD - 128),
		.numRssiIdle = RADIO_LBT_RSSI_NIDLE,
		.numRssiBusy = RADIO_LBT_RSSI_NBUSY,
		.corrPeriod = RADIO_LBT_CORR_PERIOD,
		.corrConfig.numCorrInv = RADIO_LBT_CORR_NINVD,
		.corrConfig.numCorrBusy = RADIO_LBT_CORR_NBUSY,
		// How to end: time relative to start
		.csEndTrigger.triggerType = TRIG_REL_START,
		.csEndTrigger.bEnaCmd = 0,
		.csEndTrigger.triggerNo = 0,
		.csEndTrigger.pastTrig = 0,
		// Converted from milliseconds to RAT 4MHz ticks
		.csEndTime = (RADIO_LBT_SENSE_TIME * RAT_TICKS_PER_US * 1024),
	};
#endif /* RADIO_LBT_SENSE > 0 */

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)

#if RADIO_DEFAULT_POWER > 7
#error "S: PXOPTIONS requires RADIO_DEFAULT_POWER <= 7"
#endif

static rfc_CMD_SET_TX_POWER_t cmd_sp = {
		.commandNo = CMD_SET_TX_POWER
	};

#endif

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
// Accumulated backoff
static word	bckf_lbt = 0;
#define	update_bckf_lbt(v)	bckf_lbt += (v)
#else
#define	update_bckf_lbt(v)	CNOP
#endif
		
// As far as I can tell, the trim structure can be set up once (RF need not be
// powered on) and then written to RF core when it comes up, so I am splitting
// the operation into two parts ... we shall see
static rfTrim_t rfTrim;

// ============================================================================

static void issue_cmd (lword cmd) {
//
// Issue a command to the radio, wait for (immediate) status, detect low-level
// problems (no interrupts)
//
	int res;

#ifdef	DETECT_HANGUPS
	int cnt = DETECT_HANGUPS * 900;
#endif
	while (1) {
		if ((res = RFCDoorbellSendTo (cmd) & 0xff) == 0x01)
			return;
		// We ignore the (larger) status for now; do we need it?
		if (res != 0x86)
			// Some fundamental problem
			syserror (EHARDWARE, "rt1");
		// Otherwise it means: previous command not completed, so keep
		// trying
#ifdef	DETECT_HANGUPS
		if (cnt-- == 0) {
			diag ("HUP %lx %lx", cmd, res);
			syserror (EHARDWARE, "hang ic0");
		}
#endif
		udelay (1);
	}
}

static void wait_cmd (rfc_radioOp_t *cmd, lword tstat, lword timeout) {
//
// Wait for a radio operation command to complete (for those commands for
// which we want to wait without involving interrupts)
//
	while (1) {
		if (cmd->status == tstat)
			// Target status reached
			return;
		if (timeout-- == 0) {
#ifdef DETECT_HANGUPS
			diag ("HUP %lx %lx %lx", cmd->commandNo,
				cmd->status, tstat);
#endif
			syserror (EHARDWARE, "rt2");
		}
		udelay (1);
	}
}

static void enable_event (aword ev) {
//
// Make the specified event trigger-able by an RF interrupt
//
	to_trigger = ev;
	RFCCpeIntClear (LWNONE);
	RFCCpe0IntEnable (RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE |
				RFC_DBELL_RFCPEIEN_RX_OK |
					RFC_DBELL_RFCPEIEN_INTERNAL_ERROR);
}

// ============================================================================

static void rf_on () {
//
// Turn the radio on
//
	if (dstate & DSTATE_RFON)
		return;

	TIME_COLDSTART_ON;

