senserf/picos/PicOS/CC13XX/TENTATIVE/rfprop_nowor_ok.c
#ifdef	RADIO_PINS_ON
	// Any special pin settings?
	RADIO_PINS_ON;
#endif
	// The oscillator (do we need this?); no, this is the default, anyway
	// OSCXHfPowerModeSet (HIGH_POWER_XOSC);

	// The default setting of OSC clock source is OSC_RCOSC_HF; we shall
	// revert to it when the radio is switched off
	OSCHF_TurnOnXosc();
	while (!OSCHF_AttemptToSwitchToXosc ());
	//do { udelay (10); } while (!OSCHF_AttemptToSwitchToXosc ());

	// Make sure RAT is driven by RTC
	HWREGBITW (AON_RTC_BASE + AON_RTC_O_CTL, AON_RTC_CTL_RTC_UPD_EN_BITN) =
		1;

	// Power up the domain (there's no peripheral for RF)
	__pi_ondomain (PRCM_DOMAIN_RFCORE);

	// Enable the clock
	RFCClockEnable ();

	// Set up some magic for the patches to work
	issue_cmd (
		CMDR_DIR_CMD_2BYTE (RF_CMD0,
			RFC_PWR_PWMCLKEN_MDMRAM | RFC_PWR_PWMCLKEN_RFERAM));
	// Apply the patches
	rf_patch_cpe_genfsk ();
	rf_patch_rfe_genfsk ();	
	// Undo the magic
        issue_cmd (CMDR_DIR_CMD_2BYTE (RF_CMD0, 0));

#if 1
        // Initialize bus request; AFAICT, this is only needed if we want to
	// deep sleep while the radio is sending data to our RAM
	issue_cmd (CMDR_DIR_CMD_1BYTE (CMD_BUS_REQUEST, 1));
#endif

	RFCAdi3VcoLdoVoltageMode (true);

	// This must be done with RF core on, on every startup
       	RFCRfTrimSet (&rfTrim);

#if 0
	// Show up the firmware version on first power up
	issue_cmd ((lword)&cmd_gfi);
	diag ("RF: %x %x %x %x",
					cmd_gfi.versionNo,
					cmd_gfi.startOffset,
					cmd_gfi.freeRamSz,
					cmd_gfi.availRatCh);
#endif

#if 0
	// Check connection?
	issue_cmd ((lword)&cmd_pin);
#endif

	// Setup the "proprietary" mode
	issue_cmd ((lword)&RF_cmdPropRadioDivSetup);
	// Wait until done
	wait_cmd ((rfc_radioOp_t*)&RF_cmdPropRadioDivSetup, PROP_DONE_OK,
		10000);

	// Start RAT
	issue_cmd ((lword)&cmd_srt);

	// Power up frequency synthesizer; apparently this is needed if
	// CMD_PROP_RADIO_DIV_SETUP.bNoFsPowrup == 1 (it is zero, as set by
	// SmartRF Studio)

	// Set the frequency
	issue_cmd ((lword)&RF_cmdFs);
	wait_cmd ((rfc_radioOp_t*)&RF_cmdFs, DONE_OK, 10000);

	_BIS (dstate, DSTATE_RFON);

	// Interrupts, we only care about reception and system error (?)
	HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIEN) = 0;
	HWREG (RFC_DBELL_BASE+RFC_DBELL_O_RFCPEIFG) = 0;
	IntEnable (INT_RFC_CPE_0);

	LEDI (0, 1);

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
	bckf_lbt = 0;
#endif
	TIME_COLDSTART_OFF;
}

static void rx_de () {
//
// Deactivate the receiver
//
	if ((dstate & DSTATE_RXAC)) {
		issue_cmd (CMDR_DIR_CMD (CMD_ABORT));
		_BIC (dstate, DSTATE_RXAC);
		to_trigger = 0;
	}
}

static void rf_off () {
//
// Turn the radio off
//
	if ((dstate & DSTATE_RFON) == 0)
		return;

	TIME_COLDSTART_ON;

	rx_de ();

	IntDisable (INT_RFC_CPE_0);

	RFCAdi3VcoLdoVoltageMode (false);

	// Without this, the domain isn't truly switched off
	RFCSynthPowerDown ();

	RFCClockDisable ();

	__pi_offdomain (PRCM_DOMAIN_RFCORE);

	// Decouple RAT from RTC
	HWREGBITW (AON_RTC_BASE + AON_RTC_O_CTL, AON_RTC_CTL_RTC_UPD_EN_BITN) =
		0;

	OSCHF_SwitchToRcOscTurnOffXosc ();

#ifdef	RADIO_PINS_OFF
	RADIO_PINS_OFF;
#endif
	_BIC (dstate, DSTATE_RFON);
	LEDI (0, 0);

	TIME_COLDSTART_OFF;
}

static void rx_ac () {
//
// Activate the receiver
//
	rfc_dataEntryGeneral_t *re;
	int i;

	// One hard prereq
	rf_on ();
	if (dstate & DSTATE_RXAC)
		return;

	// Make sure the buffers are clean
	for (re = (rfc_dataEntryGeneral_t*) (rbuffs->pCurrEntry), i = 0;
    	    i < NRBUFFS; i++, re = (rfc_dataEntryGeneral_t*)(re->pNextEntry))
			re->status = DATA_ENTRY_PENDING;

	_BIS (dstate, DSTATE_RXAC);
	issue_cmd ((lword)&RF_cmdPropRx);
}

static void plugch () {
//
// Insert the channel number as the right frequency in the proper place
//
	RF_cmdFs.frequency = 
		// Channel number is just the megahertz increment
		RF_cmdPropRadioDivSetup.centerFreq = CC1350_BASEFREQ + channel;
}

#if RADIO_BITRATE_INDEX > 0

static void plugrt () {
//
// Insert the rate parameters
//
	RF_cmdPropRadioDivSetup.symbolRate.preScale = ratable [vrate] . ps;
	RF_cmdPropRadioDivSetup.symbolRate.rateWord = ratable [vrate] . rw;
}

#endif

static int rx_int_enable () {

	rfc_dataEntryGeneral_t *db;
	int i, pl, nr;

	// This clears all interrupt flags and enables those that we want; this
	// is different than (e.g.) in CC1100/MSP430, because events can be
	// lost (the clear operation may remove an event that we haven't looked
	// at yet); so we do the reception with interrupts enabled; if an
	// interrupt arrives while we are looking, it will just unblock the
	// driver thread which will force (later) another invocation of this
	// function. But it is important to always make sure that when the
	// function is being invoked, the driver thread is already waiting for
	// qevent.

	enable_event (qevent);

#define	__dp	(&(db->data))
#define	__pk	((address)(__dp + 2))
#define	__ni	(__pk [0])

	// Receive
	for (db = (rfc_dataEntryGeneral_t*) (rbuffs->pCurrEntry), i = nr = 0;
	    i < NRBUFFS; i++, db = (rfc_dataEntryGeneral_t*)(db->pNextEntry)) {
		if (db->status == DATA_ENTRY_FINISHED) {
			LEDI (2, 1);

			// Consistency checks
			if (
				// Physical length matches logical length ...
				     __dp [0] == __dp [1] + 3 
				// ... and the packet fits into RX buffer ...
				  && __dp [1] <= rbuffl
				// ... and it has at least 2 bytes of payload
				// and the payload length is even ...
			    	  && __dp [1] >= 2 && (__dp [1] & 1) == 0
				// ... and the NetId check passes which means
				// that:
#if 1
				  && (
					// the NetIds are same ...
					     __ni == statid
					// ... or the packet is global ...
					  || __ni == 0
					// ... or we are promiscuous
					  || statid == 0 || statid == 0xffff
				  )
#endif
			    ) {
				// Packet length plus two extra bytes at the
				// end
				pl = __dp [1] + 2;
				// Swap RSS and status, actually move RSS one
				// byte up and zero the status (for now); RSS
				// is unbiased to nonnegative (as per usual)
				add_entropy (__dp [pl]);
				__dp [pl + 1] = __dp [pl] + 128;
				__dp [pl] = 0;
				nr++;
				tcvphy_rcv (physid, __pk, pl);
			}
#ifdef	DETECT_HANGUPS
			else {
				diag ("BAD RX");
			}
#endif
			// Mark the buffer as free
			db->status = DATA_ENTRY_PENDING;
		}
	}

#undef __dp
#undef __pk
#undef __ni

