senserf/picos/PicOS/CC13XX/TENTATIVE/rfprop_nowor_ok.c
	if (nr) {
		gbackoff_rcv;
	}

	LEDI (2, 0);
	// State OK
	return NO;
}

void RFCCPE0IntHandler (void) {
//
// Any interrupt (of the enabled kind) just unhangs the driver thread
//
	if (HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIFG) &
	    RFC_DBELL_RFCPEIFG_INTERNAL_ERROR)
		// Internal error
		_BIS (dstate, DSTATE_IRST);


	// Clear all interrupts (why do they do it in a loop?); must be some
	// magic, because it didn't work for me the sane way
	RFCCpeIntClear (LWNONE);
	// HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIFG) = 0;
	// Disable
	RFCCpeIntDisable (LWNONE);
	// HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIEN) = 0;

	if (to_trigger) {
		p_trigger (drvprcs, to_trigger);
		// Only once ?
		to_trigger = 0;
	}

	RISE_N_SHINE;
}

// ============================================================================

#define	DR_LOOP		0
#define	DR_XMIT		1
#define	DR_FRCE		2
#define	DR_FXMT		3
#define	DR_GOOF		4
#define	DR_WRES		5
#define	DR_WURG		6
#define	DR_WXMT		7

#define	the_packet 		(RF_cmdPropTx.pPkt)
#define	the_packet_length 	(RF_cmdPropTx.pktLen)

#ifdef	DETECT_HANGUPS
static	lword txcounter;
#endif

thread (cc1350_driver)

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
	address ppm;
	word pcav;
#endif
	entry (DR_LOOP)

		// We come here for anything that happens; dstate tells us
		// where we are statewise:
		//
		// RXON = we want RX to be on (modified by PHYSOPT only)
		// RFON = the device is on
		// RXAC	= RX active
		// IRST = reset requested
		// TXIP = packet being transmitted
DR_LOOP__:
		// Make sure the packet is unlocked whenever we get here; it
		// is definitely not being transmitted
		_BIC (dstate, DSTATE_TXIP);
		
		// Reset request is easy; make sure this is the only place
		// where reset is actually handled (and the flag is cleared)
		if (dstate & DSTATE_IRST) {
			// Remove the flag
			_BIC (dstate, DSTATE_IRST);
			// Turn the device off; this will clear: RFON, RXAC
			rf_off ();
			// Things should get back to where they were in the
			// following sequence
		}

		if (dstate & DSTATE_RXON) {
			// The RX is ON
			if ((dstate & DSTATE_RXAC) == 0) {
				rx_ac ();
			}
		} else {
			// RX is meant to be off, make sure it is
			rx_de ();
		}

		// We have gotten the state right, see if there is a packet
		// to transmit
		if (paylen == 0) {
			// We have to look at the queue. If paylen != 0, it
			// means that we have a previous packet (already
			// extracted from the queue)
			if ((the_packet = (byte*)tcvphy_get (physid, &paylen))
			    != NULL) {
				// Ignore the two extra bytes right away, we
				// have no use for them
				paylen -= 2;
				sysassert (paylen <= rbuffl && paylen > 0 &&
				    (paylen & 1) == 0, "cc13 py");

				LEDI (1, 1);

				if (statid != 0xffff)
					// Insert NetId
					((address)the_packet) [0] = statid;

				// Plug it into the command
				the_packet_length = (byte) paylen;
			}
		}

		if (paylen == 0) {
			// If paylen is still zero, there is nothing to
			// transmit at the moment
			wait (qevent, DR_LOOP);
			if (dstate & DSTATE_RXAC) {
				// Try to receive. Note that we have
				// to issue wait before this operation because
				// of the interrupt race
				if (rx_int_enable ())
					goto DR_LOOP__;
				// For lost interrupts (test)
				// delay (1024, DR_LOOP);
			} else if (dstate & DSTATE_RFON) {
				// Nothing to transmit and the receiver is OFF,
				// turn the radio off after a delay.
				delay (params . offdelay, DR_GOOF);
			}
			// Do nothing until something happens
			release;
		}

		if (bckf_timer) {
			// Backoff wait
#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
Bkf:
#endif
			wait (qevent, DR_LOOP);
			delay (bckf_timer, DR_LOOP);
			if (dstate & DSTATE_RXAC) {
				// Don't forget about receiving packets instead
				// of sitting on your hands
				if (rx_int_enable ())
					goto DR_LOOP__;
			}
			release;
		}

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
		// Check for CAV requested in the packet
		ppm = (address)(the_packet + paylen);
		if ((pcav = (*ppm) & 0x0fff)) {
			// Remove for subsequent turns
			*ppm &= ~0x0fff;
			utimer_set (bckf_timer, pcav);
			goto Bkf;
		}
#endif
		// Make sure the device is ready
		rf_on ();
		rx_de ();

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
		// Set the transmit power according to what the packet requests
		if ((pcav = patable [(*ppm >> 12) & 0x7]) !=
		    RF_cmdPropRadioDivSetup.txPower) {
			// Need to change
		    	RF_cmdPropRadioDivSetup.txPower = 
				cmd_sp.txPower = pcav;
			issue_cmd ((lword)&cmd_sp);
		}
#endif

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
		// The obscure optional report (for tests only)
		((address)(the_packet)) [1] = bckf_lbt;
#endif
		// Lock the packet
		_BIS (dstate, DSTATE_TXIP);

#if RADIO_LBT_SENSE_TIME > 0

// ============================================================================
// LBT ON =====================================================================
// ============================================================================

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
		if (*ppm & 0x8000) {
			// LBT off requested by packet
			txtries = RADIO_LBT_MAX_TRIES;
			proceed (DR_FRCE);
		}
#endif
		cmd_cs . status = RF_cmdPropTx . status = 0;
		// Carrier sense + transmit if OK
		issue_cmd ((lword)&cmd_cs);

	entry (DR_XMIT)

		if (dstate & DSTATE_IRST)
			goto DR_LOOP__;

		wait (txevent, DR_XMIT);
		enable_event (txevent);
		if ((cmd_cs.status & 0x3000) != 0x3000)
			// Wait for command completion
			release;

		// Check the CS status
		if (cmd_cs.status == PROP_DONE_BUSY || 
		    cmd_cs.status == PROP_DONE_BUSYTIMEOUT) {
			// Carrier sense failed
			if (txtries >= RADIO_LBT_MAX_TRIES)
				// Forced TX, no CS
				proceed (DR_FRCE);
			txtries++;
			// Backoff
			// diag ("BUSY");
			gbackoff_lbt;
			update_bckf_lbt (bckf_timer);
			goto DR_LOOP__;
		}
TXEnd:
		// Release the packet
		tcvphy_end ((address)the_packet);
		paylen = 0;

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
		bckf_lbt = 0;
#endif

#if RADIO_LBT_SENSE_TIME > 0
		txtries = 0;
#endif
		LEDI (1, 0);
		gbackoff_xmt;
		// If we don't care to delay after xmt, then perhaps we
		// should send whatever pending packets we have in the queue
		// without restarting the receiver
		goto DR_LOOP__;

